---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRun.ActualTreadsNumber
source: html/14adde99-ed13-07a8-26c9-d66b6faeaa62.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.ActualTreadsNumber Property

The actual number of stairs treads in the stairs run.

## Syntax (C#)
```csharp
public int ActualTreadsNumber { get; }
```

## Remarks
This is a read-only value.